Revit 2027 API
RevitLinkType.GetLinkedFileStatus Method
 Returns the LinkedFileStatus of this link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkedFileStatus GetLinkedFileStatus()
Public Function GetLinkedFileStatus As LinkedFileStatus
public:
LinkedFileStatus GetLinkedFileStatus()
member GetLinkedFileStatus : unit -> LinkedFileStatus
Return Value
LinkedFileStatus
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace